Part6.Client/Part6.Client/web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-12-21T06:44:24.8019497Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{c650e0ec-cd20-46e9-b56d-33642e831045}" /><Execution ProcessName="WebDev.WebServer40" ProcessID="1384" ThreadID="6" /><Channel/><Computer>AVERATEC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-12-21T15:44:24.6199393+09:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPow9i6xgzWnhGiKKxP5dGU6YAAAAAOTrSP7THqUGSYIQYapKjT9feZS23pDxJt8/fM2WxUY8ACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="70317036-dd75-4fc9-abe5-b1b3c26d4cf4" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>1</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-12-21T06:44:35.3545533Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{c650e0ec-cd20-46e9-b56d-33642e831045}" /><Execution ProcessName="WebDev.WebServer40" ProcessID="1384" ThreadID="6" /><Channel/><Computer>AVERATEC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-12-21T15:44:35.2425469+09:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>582</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 21 Dec 2020 06:44:34 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:FullTimeEmployee" xmlns:a="http://pragimtech.com/2013/07/07/Employee" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:ID>1</a:ID><a:Name>Mark</a:Name><a:Gender>Mail</a:Gender><a:DateOfBirth>1982-10-10T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><b:AnnualSalary>6000</b:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-12-21T06:44:41.3478961Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{6018b855-670e-4b9f-b627-76b56ec42ead}" /><Execution ProcessName="WebDev.WebServer40" ProcessID="1384" ThreadID="6" /><Channel/><Computer>AVERATEC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-12-21T15:44:41.3478961+09:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPoxBi6xgzWnhGiKKxP5dGU6YAAAAAOTrSP7THqUGSYIQYapKjT9feZS23pDxJt8/fM2WxUY8ACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="2216cfec-eba5-485d-8a15-e35d0227b799" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>2</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-12-21T06:44:41.3838982Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{6018b855-670e-4b9f-b627-76b56ec42ead}" /><Execution ProcessName="WebDev.WebServer40" ProcessID="1384" ThreadID="6" /><Channel/><Computer>AVERATEC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-12-21T15:44:41.3838982+09:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>610</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 21 Dec 2020 06:44:41 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:PartTimeEmployee" xmlns:a="http://pragimtech.com/2013/07/07/Employee" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:ID>2</a:ID><a:Name>Mary</a:Name><a:Gender>Female</a:Gender><a:DateOfBirth>1981-11-10T00:00:00</a:DateOfBirth><a:Type>PartTimeEmployee</a:Type><b:HourlyPay>250</b:HourlyPay><b:HoursWorked>40</b:HoursWorked></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>